{"config": {"name": "HappyModel", "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "zero_padding2d_1", "config": {"name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]], "trainable": true, "data_format": "channels_last"}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv0", "config": {"activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null, "name": "conv0", "kernel_size": [7, 7], "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "bn0", "config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "trainable": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "name": "bn0", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"name": "max_pool", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pool", "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten", "inbound_nodes": [[["max_pool", 0, 0, {}]]]}, {"name": "fc", "config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "fc", "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["fc", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}