{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false, "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_1"}, "name": "zero_padding2d_1", "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "name": "conv0", "use_bias": true, "padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [7, 7], "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "activation": "linear", "bias_constraint": null}, "name": "conv0", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": 3, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn0", "scale": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "center": true, "gamma_regularizer": null}, "name": "bn0", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pool", "strides": [2, 2]}, "name": "max_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pool", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "fc", "units": 1, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null}, "name": "fc", "class_name": "Dense"}], "name": "HappyModel", "output_layers": [["fc", 0, 0]]}, "keras_version": "2.2.4", "class_name": "Model"}